bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_aonp_struct.h
// Copyright 2022-2023 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

// This is a generated file, if you need to modify it, use the script to
// generate and modify all the struct.h, ll.h, reg.h, debug_dump.c files!

#pragma once

#ifdef __cplusplus
extern "C" {
#endif


typedef volatile union {
	struct {
		uint32_t deviceid                         : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg0_t;


typedef volatile union {
	struct {
		uint32_t versionid                        : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg1_t;


typedef volatile union {
	struct {
		uint32_t boot_mode                        :  1; /**<bit[0 : 0] */
		uint32_t clkg_bps                         :  1; /**<bit[1 : 1] */
		uint32_t reserved_bit_2_3                 :  2; /**<bit[2 : 3] */
		uint32_t rf_switch_manual_en              :  1; /**<bit[4 : 4] */
		uint32_t rf_source                        :  2; /**<bit[5 : 6] */
		uint32_t jtag_core_sel                    :  1; /**<bit[7 : 7] */
		uint32_t reserved_bit_8_8                 :  1; /**<bit[8 : 8] */
		uint32_t flash_sel                        :  1; /**<bit[9 : 9] */
		uint32_t fem_bps_txen                     :  1; /**<bit[10 : 10] */
		uint32_t gpio_flash_sys_enable            :  1; /**<bit[11 : 11] */
		uint32_t boot_mode_norst                  :  1; /**<bit[12 : 12] */
		uint32_t reserved_bit_13_31               : 19; /**<bit[13 : 31] */
	};
	uint32_t v;
} sys_aonp_reg2_t;


typedef volatile union {
	struct {
		uint32_t core0_halted                     :  1; /**<bit[0 : 0] */
		uint32_t core1_halted                     :  1; /**<bit[1 : 1] */
		uint32_t reserved_bit_2_3                 :  2; /**<bit[2 : 3] */
		uint32_t cpu0_sw_reset                    :  1; /**<bit[4 : 4] */
		uint32_t cpu1_sw_reset                    :  1; /**<bit[5 : 5] */
		uint32_t reserved_bit_6_7                 :  2; /**<bit[6 : 7] */
		uint32_t cpu0_pwr_dw_state                :  1; /**<bit[8 : 8] */
		uint32_t cpu1_pwr_dw_state                :  1; /**<bit[9 : 9] */
		uint32_t reserved_bit_10_11               :  2; /**<bit[10 : 11] */
		uint32_t cpu0_exist                       :  1; /**<bit[12 : 12] */
		uint32_t cpu1_exist                       :  1; /**<bit[13 : 13] */
		uint32_t cpu2_exist                       :  1; /**<bit[14 : 14] */
		uint32_t cpu3_exist                       :  1; /**<bit[15 : 15] */
		uint32_t reserved_bit_16_31               : 16; /**<bit[16 : 31] */
	};
	uint32_t v;
} sys_aonp_reg3_t;


typedef volatile union {
	struct {
		uint32_t cpu0_sw_rst                      :  1; /**<bit[0 : 0] */
		uint32_t cpu0_pwr_dw                      :  1; /**<bit[1 : 1] */
		uint32_t cpu_int_mask                     :  1; /**<bit[2 : 2] */
		uint32_t cpu0_halt                        :  1; /**<bit[3 : 3] */
		uint32_t reserved_bit_4_4                 :  1; /**<bit[4 : 4] */
		uint32_t cpu0_rxevt_sel                   :  2; /**<bit[5 : 6] */
		uint32_t reserved_7_7                     :  1; /**<bit[7 : 7] */
		uint32_t cpu0_offset                      : 24; /**<bit[8 : 31] */
	};
	uint32_t v;
} sys_aonp_reg4_t;


typedef volatile union {
	struct {
		uint32_t cpu1_sw_rst                      :  1; /**<bit[0 : 0] */
		uint32_t cpu1_pwr_dw                      :  1; /**<bit[1 : 1] */
		uint32_t reserved_2_2                     :  1; /**<bit[2 : 2] */
		uint32_t cpu1_halt                        :  1; /**<bit[3 : 3] */
		uint32_t reserved_bit_4_4                 :  1; /**<bit[4 : 4] */
		uint32_t cpu1_rxevt_sel                   :  2; /**<bit[5 : 6] */
		uint32_t reserved_7_7                     :  1; /**<bit[7 : 7] */
		uint32_t cpu1_offset                      : 24; /**<bit[8 : 31] */
	};
	uint32_t v;
} sys_aonp_reg5_t;


typedef volatile union {
	struct {
		uint32_t cksel_core                       :  2; /**<bit[0 : 1] */
		uint32_t ckdiv_core                       :  4; /**<bit[2 : 5] */
		uint32_t cksel_flash                      :  2; /**<bit[6 : 7] */
		uint32_t ckdiv_flash                      :  3; /**<bit[8 : 10] */
		uint32_t cksel_auxs                       :  2; /**<bit[11 : 12] */
		uint32_t ckdiv_auxs                       :  6; /**<bit[13 : 18] */
		uint32_t ckdiv_26mo                       :  3; /**<bit[19 : 21] */
		uint32_t reserved_22_23                   :  2; /**<bit[22 : 23] */
		uint32_t phase_cfg_960m                   :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} sys_aonp_reg8_t;


typedef volatile union {
	struct {
		uint32_t cksel_i2c0                       :  1; /**<bit[0 : 0] */
		uint32_t cksel_i2c3                       :  1; /**<bit[1 : 1] */
		uint32_t cksel_uart0                      :  1; /**<bit[2 : 2] */
		uint32_t cksel_uart1                      :  1; /**<bit[3 : 3] */
		uint32_t cksel_uart2                      :  1; /**<bit[4 : 4] */
		uint32_t cksel_uart3                      :  1; /**<bit[5 : 5] */
		uint32_t cksel_uart4                      :  1; /**<bit[6 : 6] */
		uint32_t cksel_spi0                       :  1; /**<bit[7 : 7] */
		uint32_t cksel_spi1                       :  1; /**<bit[8 : 8] */
		uint32_t cksel_spi2                       :  1; /**<bit[9 : 9] */
		uint32_t cksel_spi3                       :  1; /**<bit[10 : 10] */
		uint32_t cksel_i2s0                       :  1; /**<bit[11 : 11] */
		uint32_t ckdiv_i2s0                       :  2; /**<bit[12 : 13] */
		uint32_t cksel_i2s1                       :  1; /**<bit[14 : 14] */
		uint32_t ckdiv_i2s1                       :  2; /**<bit[15 : 16] */
		uint32_t cksel_i2s2                       :  1; /**<bit[17 : 17] */
		uint32_t ckdiv_i2s2                       :  2; /**<bit[18 : 19] */
		uint32_t cksel_i2s3                       :  1; /**<bit[20 : 20] */
		uint32_t ckdiv_i2s3                       :  2; /**<bit[21 : 22] */
		uint32_t cksel_i2s4                       :  1; /**<bit[23 : 23] */
		uint32_t ckdiv_i2s4                       :  2; /**<bit[24 : 25] */
		uint32_t cksel_sadc                       :  1; /**<bit[26 : 26] */
		uint32_t cksel_i3c                        :  1; /**<bit[27 : 27] */
		uint32_t cksel_tim0                       :  1; /**<bit[28 : 28] */
		uint32_t cksel_tim1                       :  1; /**<bit[29 : 29] */
		uint32_t cksel_tim2                       :  1; /**<bit[30 : 30] */
		uint32_t cksel_tim3                       :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_reg9_t;


typedef volatile union {
	struct {
		uint32_t cksel_pwm0                       :  1; /**<bit[0 : 0] */
		uint32_t cksel_can0                       :  1; /**<bit[1 : 1] */
		uint32_t cksel_can1                       :  1; /**<bit[2 : 2] */
		uint32_t cksel_scr0                       :  1; /**<bit[3 : 3] */
		uint32_t cksel_audio                      :  1; /**<bit[4 : 4] */
		uint32_t ckdiv_audio                      :  3; /**<bit[5 : 7] */
		uint32_t cksel_audif0                     :  1; /**<bit[8 : 8] */
		uint32_t ckdiv_audif0                     :  3; /**<bit[9 : 11] */
		uint32_t cksel_audif1                     :  1; /**<bit[12 : 12] */
		uint32_t ckdiv_audif1                     :  3; /**<bit[13 : 15] */
		uint32_t ckdiv_i2so                       :  3; /**<bit[16 : 18] */
		uint32_t cksel_auxs_enet                  :  1; /**<bit[19 : 19] */
		uint32_t ckdiv_auxs_enet                  :  4; /**<bit[20 : 23] */
		uint32_t cksel_trace                      :  1; /**<bit[24 : 24] */
		uint32_t ckdiv_trace                      :  3; /**<bit[25 : 27] */
		uint32_t reserved_28_31                   :  4; /**<bit[28 : 31] */
	};
	uint32_t v;
} sys_aonp_rega_t;


typedef volatile union {
	struct {
		uint32_t anaspi_freq                      :  6; /**<bit[0 : 5] */
		uint32_t reserved_bit_6_31                : 26; /**<bit[6 : 31] */
	};
	uint32_t v;
} sys_aonp_regb_t;


typedef volatile union {
	struct {
		uint32_t tim0_cken                        :  1; /**<bit[0 : 0] */
		uint32_t tim1_cken                        :  1; /**<bit[1 : 1] */
		uint32_t tim2_cken                        :  1; /**<bit[2 : 2] */
		uint32_t tim3_cken                        :  1; /**<bit[3 : 3] */
		uint32_t uart0_cken                       :  1; /**<bit[4 : 4] */
		uint32_t uart1_cken                       :  1; /**<bit[5 : 5] */
		uint32_t uart2_cken                       :  1; /**<bit[6 : 6] */
		uint32_t uart3_cken                       :  1; /**<bit[7 : 7] */
		uint32_t uart4_cken                       :  1; /**<bit[8 : 8] */
		uint32_t spi0_cken                        :  1; /**<bit[9 : 9] */
		uint32_t spi1_cken                        :  1; /**<bit[10 : 10] */
		uint32_t spi2_cken                        :  1; /**<bit[11 : 11] */
		uint32_t spi3_cken                        :  1; /**<bit[12 : 12] */
		uint32_t sadc_cken                        :  1; /**<bit[13 : 13] */
		uint32_t pwm0_cken                        :  1; /**<bit[14 : 14] */
		uint32_t otp_cken                         :  1; /**<bit[15 : 15] */
		uint32_t i3c_cken                         :  1; /**<bit[16 : 16] */
		uint32_t i2s0_cken                        :  1; /**<bit[17 : 17] */
		uint32_t i2s1_cken                        :  1; /**<bit[18 : 18] */
		uint32_t i2s2_cken                        :  1; /**<bit[19 : 19] */
		uint32_t i2s3_cken                        :  1; /**<bit[20 : 20] */
		uint32_t i2s4_cken                        :  1; /**<bit[21 : 21] */
		uint32_t i2c0_cken                        :  1; /**<bit[22 : 22] */
		uint32_t i2c3_cken                        :  1; /**<bit[23 : 23] */
		uint32_t irda0_cken                       :  1; /**<bit[24 : 24] */
		uint32_t irda1_cken                       :  1; /**<bit[25 : 25] */
		uint32_t irda2_cken                       :  1; /**<bit[26 : 26] */
		uint32_t irda3_cken                       :  1; /**<bit[27 : 27] */
		uint32_t can0_cken                        :  1; /**<bit[28 : 28] */
		uint32_t can1_cken                        :  1; /**<bit[29 : 29] */
		uint32_t lin0_cken                        :  1; /**<bit[30 : 30] */
		uint32_t scr0_cken                        :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_regc_t;


typedef volatile union {
	struct {
		uint32_t audio_cken                       :  1; /**<bit[0 : 0] */
		uint32_t audif0_cken                      :  1; /**<bit[1 : 1] */
		uint32_t audif1_cken                      :  1; /**<bit[2 : 2] */
		uint32_t i2so_cken                        :  1; /**<bit[3 : 3] */
		uint32_t cec_cken                         :  1; /**<bit[4 : 4] */
		uint32_t xdac0_cken                       :  1; /**<bit[5 : 5] */
		uint32_t xdac1_cken                       :  1; /**<bit[6 : 6] */
		uint32_t auxs_cken                        :  1; /**<bit[7 : 7] */
		uint32_t auxs_enet_cken                   :  1; /**<bit[8 : 8] */
		uint32_t sig_26ms_cken                    :  1; /**<bit[9 : 9] */
		uint32_t sig_32ks_cken                    :  1; /**<bit[10 : 10] */
		uint32_t sig_26mo_cken                    :  1; /**<bit[11 : 11] */
		uint32_t sig_240m_cken                    :  1; /**<bit[12 : 12] */
		uint32_t sig_320m_cken                    :  1; /**<bit[13 : 13] */
		uint32_t sig_480m_cken                    :  1; /**<bit[14 : 14] */
		uint32_t sig_160m_cken                    :  1; /**<bit[15 : 15] */
		uint32_t sig_120m_cken                    :  1; /**<bit[16 : 16] */
		uint32_t trace_cken                       :  1; /**<bit[17 : 17] */
		uint32_t reserved_18_21                   :  4; /**<bit[18 : 21] */
		uint32_t wlss_cken                        :  1; /**<bit[22 : 22] */
		uint32_t btdm_cken                        :  1; /**<bit[23 : 23] */
		uint32_t xver_cken                        :  1; /**<bit[24 : 24] */
		uint32_t mac_cken                         :  1; /**<bit[25 : 25] */
		uint32_t phy_cken                         :  1; /**<bit[26 : 26] */
		uint32_t thread_cken                      :  1; /**<bit[27 : 27] */
		uint32_t bk24_cken                        :  1; /**<bit[28 : 28] */
		uint32_t rf_cken                          :  1; /**<bit[29 : 29] */
		uint32_t ofdm_cken                        :  1; /**<bit[30 : 30] */
		uint32_t reserved_31_31                   :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_regd_t;


typedef volatile union {
	struct {
		uint32_t reserved_0_0                     :  1; /**<bit[0 : 0] */
		uint32_t reserved_1_1                     :  1; /**<bit[1 : 1] */
		uint32_t reserved_2_2                     :  1; /**<bit[2 : 2] */
		uint32_t macp_mem_ret                     :  1; /**<bit[3 : 3] */
		uint32_t phyp_mem_ret                     :  1; /**<bit[4 : 4] */
		uint32_t thread_mem_ret                   :  1; /**<bit[5 : 5] */
		uint32_t encp_mem_ret                     :  1; /**<bit[6 : 6] */
		uint32_t can0_mem_ret                     :  1; /**<bit[7 : 7] */
		uint32_t can1_mem_ret                     :  1; /**<bit[8 : 8] */
		uint32_t irda0_mem_ret                    :  1; /**<bit[9 : 9] */
		uint32_t irda1_mem_ret                    :  1; /**<bit[10 : 10] */
		uint32_t dma0_mem_ret                     :  1; /**<bit[11 : 11] */
		uint32_t spi1_mem_ret                     :  1; /**<bit[12 : 12] */
		uint32_t spi2_mem_ret                     :  1; /**<bit[13 : 13] */
		uint32_t uart1_mem_ret                    :  1; /**<bit[14 : 14] */
		uint32_t uart2_mem_ret                    :  1; /**<bit[15 : 15] */
		uint32_t uart3_mem_ret                    :  1; /**<bit[16 : 16] */
		uint32_t uart0_mem_ret                    :  1; /**<bit[17 : 17] */
		uint32_t spi0_mem_ret                     :  1; /**<bit[18 : 18] */
		uint32_t flsh_mem_ret                     :  1; /**<bit[19 : 19] */
		uint32_t audp_mem_ret                     :  1; /**<bit[20 : 20] */
		uint32_t i3c_mem_ret                      :  1; /**<bit[21 : 21] */
		uint32_t xvr_mem_ret                      :  1; /**<bit[22 : 22] */
		uint32_t reserved_23_23                   :  1; /**<bit[23 : 23] */
		uint32_t bk24_mem_ret                     :  1; /**<bit[24 : 24] */
		uint32_t irda2_mem_ret                    :  1; /**<bit[25 : 25] */
		uint32_t irda3_mem_ret                    :  1; /**<bit[26 : 26] */
		uint32_t spi3_mem_ret                     :  1; /**<bit[27 : 27] */
		uint32_t uart4_mem_ret                    :  1; /**<bit[28 : 28] */
		uint32_t cpu0_mem_ret                     :  1; /**<bit[29 : 29] */
		uint32_t cpu1_mem_ret                     :  1; /**<bit[30 : 30] */
		uint32_t coresight_mem_ret                :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_regf_t;


typedef volatile union {
	struct {
		uint32_t pwd_cpu1                         :  1; /**<bit[0 : 0] */
		uint32_t pwd_vehp                         :  1; /**<bit[1 : 1] */
		uint32_t pwd_wrls                         :  1; /**<bit[2 : 2] */
		uint32_t rom_pgen                         :  1; /**<bit[3 : 3] */
		uint32_t cpu1_isolate_state               :  1; /**<bit[4 : 4] */
		uint32_t vehp_isolate_state               :  1; /**<bit[5 : 5] */
		uint32_t wrls_isolate_state               :  1; /**<bit[6 : 6] */
		uint32_t reserved_7_30                    : 24; /**<bit[7 : 30] */
		uint32_t busmatrix_busy                   :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_reg10_t;


typedef volatile union {
	struct {
		uint32_t sleep_en_global                  :  1; /**<bit[0 : 0] */
		uint32_t sleep_en_need_flash_idle         :  1; /**<bit[1 : 1] */
		uint32_t sleep_bus_idle_bypass            :  1; /**<bit[2 : 2] */
		uint32_t sleep_en_need_cpu0_wfi           :  1; /**<bit[3 : 3] */
		uint32_t sleep_en_need_cpu1_wfi           :  1; /**<bit[4 : 4] */
		uint32_t reserved_bit_5_11                :  7; /**<bit[5 : 11] */
		uint32_t reserved_12_15                   :  4; /**<bit[12 : 15] */
		uint32_t cpu0_ticktimer_32k_enable        :  1; /**<bit[16 : 16] */
		uint32_t cpu1_ticktimer_32k_enable        :  1; /**<bit[17 : 17] */
		uint32_t reserved_bit_18_19               :  2; /**<bit[18 : 19] */
		uint32_t reserved_20_24                   :  5; /**<bit[20 : 24] */
		uint32_t bts_soft_wakeup_req              :  1; /**<bit[25 : 25] */
		uint32_t rom_rd_disable                   :  1; /**<bit[26 : 26] */
		uint32_t otp_rd_disable                   :  1; /**<bit[27 : 27] */
		uint32_t share_mem_clkgating_disable      :  1; /**<bit[28 : 28] */
		uint32_t reserved_29_31                   :  3; /**<bit[29 : 31] */
	};
	uint32_t v;
} sys_aonp_reg11_t;


typedef volatile union {
	struct {
		uint32_t cpu0_inten                       : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg14_t;


typedef volatile union {
	struct {
		uint32_t cpu0_inten                       : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg15_t;


typedef volatile union {
	struct {
		uint32_t cpu0_inten                       : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg16_t;


typedef volatile union {
	struct {
		uint32_t cpu1_inten                       : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg17_t;


typedef volatile union {
	struct {
		uint32_t cpu1_inten                       : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg18_t;


typedef volatile union {
	struct {
		uint32_t cpu1_inten                       : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg19_t;


typedef volatile union {
	struct {
		uint32_t m55sub_inten                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg1a_t;


typedef volatile union {
	struct {
		uint32_t m55sub_inten                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg1b_t;


typedef volatile union {
	struct {
		uint32_t m55sub_inten                     : 31; /**<bit[0 : 30] */
		uint32_t m55sub_wakeup                    :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_reg1c_t;


typedef volatile union {
	struct {
		uint32_t spsh_cfg                         : 10; /**<bit[0 : 9] */
		uint32_t spbh_cfg                         : 11; /**<bit[10 : 20] */
		uint32_t reserved_bit_21_23               :  3; /**<bit[21 : 23] */
		uint32_t set_key                          :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} sys_aonp_reg1e_t;


typedef volatile union {
	struct {
		uint32_t stph_cfg                         : 12; /**<bit[0 : 11] */
		uint32_t reserved_bit_12_23               : 12; /**<bit[12 : 23] */
		uint32_t set_key                          :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} sys_aonp_reg1f_t;


typedef volatile union {
	struct {
		uint32_t ints_status0                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg20_t;


typedef volatile union {
	struct {
		uint32_t ints_status1                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg21_t;


typedef volatile union {
	struct {
		uint32_t ints_status2                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg22_t;


typedef volatile union {
	struct {
		uint32_t ints_status3                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg23_t;


typedef volatile union {
	struct {
		uint32_t ints_status4                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg24_t;


typedef volatile union {
	struct {
		uint32_t ints_status5                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg25_t;


typedef volatile union {
	struct {
		uint32_t m55sub_status0                   : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg26_t;


typedef volatile union {
	struct {
		uint32_t m55sub_status1                   : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg27_t;


typedef volatile union {
	struct {
		uint32_t m55sub_status2                   : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg28_t;


typedef volatile union {
	struct {
		uint32_t debug_gpio_ie                    : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg2a_t;


typedef volatile union {
	struct {
		uint32_t debug_gpio_i                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg2b_t;


typedef volatile union {
	struct {
		uint32_t cache_clean_mode                 :  1; /**<bit[0 : 0] */
		uint32_t cpu0_icache_clean_mode           :  1; /**<bit[1 : 1] */
		uint32_t cpu0_icache_clean_tag_sel        :  1; /**<bit[2 : 2] */
		uint32_t l2_cache_clean_mode              :  1; /**<bit[3 : 3] */
		uint32_t l2_cache_clean_tag_sel           :  2; /**<bit[4 : 5] */
		uint32_t reserved_6_23                    : 18; /**<bit[6 : 23] */
		uint32_t set_key                          :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} sys_aonp_reg2c_t;


typedef volatile union {
	struct {
		uint32_t spsl_cfg                         : 10; /**<bit[0 : 9] */
		uint32_t spbl_cfg                         : 11; /**<bit[10 : 20] */
		uint32_t reserved_bit_21_23               :  3; /**<bit[21 : 23] */
		uint32_t set_key                          :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} sys_aonp_reg2e_t;


typedef volatile union {
	struct {
		uint32_t stpl_cfg                         : 12; /**<bit[0 : 11] */
		uint32_t reserved_bit_12_23               : 12; /**<bit[12 : 23] */
		uint32_t set_key                          :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} sys_aonp_reg2f_t;


typedef volatile union {
	struct {
		uint32_t gpio_input_status0               : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg30_t;


typedef volatile union {
	struct {
		uint32_t gpio_input_status1               : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg31_t;


typedef volatile union {
	struct {
		uint32_t gpio_input_status2               :  8; /**<bit[0 : 7] */
		uint32_t reserved_bit_8_30                : 23; /**<bit[8 : 30] */
		uint32_t gpio_input_status_en             :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_reg32_t;


typedef volatile union {
	struct {
		uint32_t acomp0_pwm0_sample_en            :  1; /**<bit[0 : 0] */
		uint32_t acomp1_pwm0_sample_en            :  1; /**<bit[1 : 1] */
		uint32_t reserved_2_15                    : 14; /**<bit[2 : 15] */
		uint32_t l2_dis_pwr_down_maint            :  1; /**<bit[16 : 16] */
		uint32_t l2_apb_violation_resp            :  1; /**<bit[17 : 17] */
		uint32_t cpu0_dbgen_l2_rst_dis            :  1; /**<bit[18 : 18] */
		uint32_t cpu1_dbgen_l2_rst_dis            :  1; /**<bit[19 : 19] */
		uint32_t reserved_20_23                   :  4; /**<bit[20 : 23] */
		uint32_t cpu0_wfe_src                     :  1; /**<bit[24 : 24] */
		uint32_t cpu0_wfe_pulse                   :  1; /**<bit[25 : 25] */
		uint32_t cpu1_wfe_src                     :  1; /**<bit[26 : 26] */
		uint32_t cpu1_wfe_pulse                   :  1; /**<bit[27 : 27] */
		uint32_t cpu0_sleeping_state              :  1; /**<bit[28 : 28] */
		uint32_t cpu0_deepsleep_state             :  1; /**<bit[29 : 29] */
		uint32_t cpu1_sleeping_state              :  1; /**<bit[30 : 30] */
		uint32_t cpu1_deepsleep_state             :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_reg33_t;


