bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_aonp_struct.h
typedef volatile union {
	struct {
		uint32_t cpu0_curpc                       : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg34_t;


typedef volatile union {
	struct {
		uint32_t cpu0_faultstat_h                 : 11; /**<bit[0 : 10] */
		uint32_t reserved_11_31                   : 21; /**<bit[11 : 31] */
	};
	uint32_t v;
} sys_aonp_reg35_t;


typedef volatile union {
	struct {
		uint32_t cpu0_faultstat_l                 : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg36_t;


typedef volatile union {
	struct {
		uint32_t cpu0_intnum                      :  9; /**<bit[0 : 8] */
		uint32_t cpu0_currpri                     :  8; /**<bit[9 : 16] */
		uint32_t cpu0_currns                      :  1; /**<bit[17 : 17] */
		uint32_t cpu0_halted                      :  1; /**<bit[18 : 18] */
		uint32_t cpu0_nc_hready                   :  1; /**<bit[19 : 19] */
		uint32_t cpu_cache_m_hready               :  1; /**<bit[20 : 20] */
		uint32_t cpu0_resetn                      :  1; /**<bit[21 : 21] */
		uint32_t reserved_22_31                   : 10; /**<bit[22 : 31] */
	};
	uint32_t v;
} sys_aonp_reg37_t;


typedef volatile union {
	struct {
		uint32_t dbug_config0                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg38_t;


typedef volatile union {
	struct {
		uint32_t dbug_config1                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg39_t;


typedef volatile union {
	struct {
		uint32_t anareg_stat                      : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg3a_t;


typedef volatile union {
	struct {
		uint32_t coresight_chn_gate_en            : 24; /**<bit[0 : 23] */
		uint32_t coresight_tpmaxdatasize          :  5; /**<bit[24 : 28] */
		uint32_t coresight_valid                  :  1; /**<bit[29 : 29] */
		uint32_t reserved_30_30                   :  1; /**<bit[30 : 30] */
		uint32_t anaregb_stat                     :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_reg3b_t;


typedef volatile union {
	struct {
		uint32_t cpu1_curpc                       : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg3c_t;


typedef volatile union {
	struct {
		uint32_t cpu1_faultstat_h                 : 11; /**<bit[0 : 10] */
		uint32_t reserved_11_31                   : 21; /**<bit[11 : 31] */
	};
	uint32_t v;
} sys_aonp_reg3d_t;


typedef volatile union {
	struct {
		uint32_t cpu1_faultstat_l                 : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_reg3e_t;


typedef volatile union {
	struct {
		uint32_t cpu1_intnum                      :  9; /**<bit[0 : 8] */
		uint32_t cpu1_currpri                     :  8; /**<bit[9 : 16] */
		uint32_t cpu1_currns                      :  1; /**<bit[17 : 17] */
		uint32_t cpu1_halted                      :  1; /**<bit[18 : 18] */
		uint32_t cpu1_nc_hready                   :  1; /**<bit[19 : 19] */
		uint32_t reserved_20_20                   :  1; /**<bit[20 : 20] */
		uint32_t cpu1_resetn                      :  1; /**<bit[21 : 21] */
		uint32_t reserved_22_31                   : 10; /**<bit[22 : 31] */
	};
	uint32_t v;
} sys_aonp_reg3f_t;


typedef volatile union {
	struct {
		uint32_t dpll_tsten                       :  1; /**<bit[0 : 0] */
		uint32_t cp                               :  3; /**<bit[1 : 3] */
		uint32_t spideten                         :  1; /**<bit[4 : 4] */
		uint32_t hvref                            :  2; /**<bit[5 : 6] */
		uint32_t lvref                            :  2; /**<bit[7 : 8] */
		uint32_t rzctrl26m                        :  1; /**<bit[9 : 9] */
		uint32_t looprzctrl                       :  4; /**<bit[10 : 13] */
		uint32_t rpc                              :  2; /**<bit[14 : 15] */
		uint32_t openloop_en                      :  1; /**<bit[16 : 16] */
		uint32_t cksel                            :  2; /**<bit[17 : 18] */
		uint32_t spitrig                          :  1; /**<bit[19 : 19] */
		uint32_t band                             :  1; /**<bit[20 : 20] */
		uint32_t band_1                           :  1; /**<bit[21 : 21] */
		uint32_t band_2                           :  3; /**<bit[22 : 24] */
		uint32_t bandmanual                       :  1; /**<bit[25 : 25] */
		uint32_t dsptrig                          :  1; /**<bit[26 : 26] */
		uint32_t lpen_dpll                        :  1; /**<bit[27 : 27] */
		uint32_t nc_28_29                         :  2; /**<bit[28 : 29] */
		uint32_t bp_caldone                       :  1; /**<bit[30 : 30] */
		uint32_t vctrl_dpllldo                    :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg0_t;


typedef volatile union {
	struct {
		uint32_t vcooffset                        :  1; /**<bit[0 : 0] */
		uint32_t selpol                           :  1; /**<bit[1 : 1] */
		uint32_t dlysel                           :  2; /**<bit[2 : 3] */
		uint32_t edgesel_nck                      :  1; /**<bit[4 : 4] */
		uint32_t nload_dlyen                      :  1; /**<bit[5 : 5] */
		uint32_t cp                               :  3; /**<bit[6 : 8] */
		uint32_t spideten                         :  1; /**<bit[9 : 9] */
		uint32_t cben                             :  1; /**<bit[10 : 10] */
		uint32_t hvref                            :  2; /**<bit[11 : 12] */
		uint32_t lvref                            :  2; /**<bit[13 : 14] */
		uint32_t rzctrl26m                        :  1; /**<bit[15 : 15] */
		uint32_t lpfrz                            :  4; /**<bit[16 : 19] */
		uint32_t rpc                              :  3; /**<bit[20 : 22] */
		uint32_t dpll_tsten                       :  1; /**<bit[23 : 23] */
		uint32_t kctrl                            :  2; /**<bit[24 : 25] */
		uint32_t vsel_ldo                         :  2; /**<bit[26 : 27] */
		uint32_t div_sw                           :  1; /**<bit[28 : 28] */
		uint32_t bp_caldone                       :  1; /**<bit[29 : 29] */
		uint32_t ck2xen                           :  1; /**<bit[30 : 30] */
		uint32_t int_mod                          :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg1_t;


typedef volatile union {
	struct {
		uint32_t xtalh_ctune                      :  8; /**<bit[0 : 7] */
		uint32_t force_26mpll                     :  1; /**<bit[8 : 8] */
		uint32_t nc_9_11                          :  3; /**<bit[9 : 11] */
		uint32_t gadc_sd1v                        :  1; /**<bit[12 : 12] */
		uint32_t gadc_bscalsaw                    :  3; /**<bit[13 : 15] */
		uint32_t gadc_vncalsaw                    :  3; /**<bit[16 : 18] */
		uint32_t gadc_vpcalsaw                    :  3; /**<bit[19 : 21] */
		uint32_t nc_22_22                         :  1; /**<bit[22 : 22] */
		uint32_t gadc_vbg_sel                     :  1; /**<bit[23 : 23] */
		uint32_t gadc_clk_rlten                   :  1; /**<bit[24 : 24] */
		uint32_t gadc_calintsaw_en                :  1; /**<bit[25 : 25] */
		uint32_t gadc_clk_sel                     :  1; /**<bit[26 : 26] */
		uint32_t gadc_clk_inv                     :  1; /**<bit[27 : 27] */
		uint32_t gadc_calcap_ch                   :  2; /**<bit[28 : 29] */
		uint32_t gadc_inbuf_en                    :  1; /**<bit[30 : 30] */
		uint32_t gadc_en_spi                      :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg2_t;


typedef volatile union {
	struct {
		uint32_t nc_0_6                           :  7; /**<bit[0 : 6] */
		uint32_t anabuf_sel_rx                    :  1; /**<bit[7 : 7] */
		uint32_t hpssren                          :  1; /**<bit[8 : 8] */
		uint32_t ck_sel                           :  1; /**<bit[9 : 9] */
		uint32_t anabuf_sel_tx                    :  1; /**<bit[10 : 10] */
		uint32_t pwd_xtalldo                      :  1; /**<bit[11 : 11] */
		uint32_t iamp                             :  1; /**<bit[12 : 12] */
		uint32_t vddren                           :  1; /**<bit[13 : 13] */
		uint32_t xamp                             :  6; /**<bit[14 : 19] */
		uint32_t vosel                            :  5; /**<bit[20 : 24] */
		uint32_t en_xtalh_sleep                   :  1; /**<bit[25 : 25] */
		uint32_t xtal40_en                        :  1; /**<bit[26 : 26] */
		uint32_t bufictrl                         :  1; /**<bit[27 : 27] */
		uint32_t ibias_ctrl                       :  2; /**<bit[28 : 29] */
		uint32_t icore_ctrl                       :  2; /**<bit[30 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg3_t;


typedef volatile union {
	struct {
		uint32_t cktst_sel                        :  2; /**<bit[0 : 1] */
		uint32_t ck_tst_en                        :  1; /**<bit[2 : 2] */
		uint32_t vusbsel                          :  2; /**<bit[3 : 4] */
		uint32_t nc_5_16                          : 12; /**<bit[5 : 16] */
		uint32_t gadc_inbuff_isel                 :  3; /**<bit[17 : 19] */
		uint32_t gadc_biasamp_isel                :  3; /**<bit[20 : 22] */
		uint32_t gadc_comp_isel                   :  3; /**<bit[23 : 25] */
		uint32_t gadc_preamp_isel                 :  3; /**<bit[26 : 28] */
		uint32_t gadc_bufamp_isel                 :  3; /**<bit[29 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg4_t;


typedef volatile union {
	struct {
		uint32_t en_vout                          :  1; /**<bit[0 : 0] */
		uint32_t en_xtall                         :  1; /**<bit[1 : 1] */
		uint32_t en_dco                           :  1; /**<bit[2 : 2] */
		uint32_t nc_3_3                           :  1; /**<bit[3 : 3] */
		uint32_t en_temp                          :  1; /**<bit[4 : 4] */
		uint32_t en_dpll                          :  1; /**<bit[5 : 5] */
		uint32_t en_cb                            :  1; /**<bit[6 : 6] */
		uint32_t gpio_latch                       :  1; /**<bit[7 : 7] */
		uint32_t nc_8_11                          :  4; /**<bit[8 : 11] */
		uint32_t rosc_disable                     :  1; /**<bit[12 : 12] */
		uint32_t pwdaudpll                        :  1; /**<bit[13 : 13] */
		uint32_t pwd_rosc_spi                     :  1; /**<bit[14 : 14] */
		uint32_t nc_15_15                         :  1; /**<bit[15 : 15] */
		uint32_t itune_xtall                      :  4; /**<bit[16 : 19] */
		uint32_t xtall_ten                        :  1; /**<bit[20 : 20] */
		uint32_t rosc_tsten                       :  1; /**<bit[21 : 21] */
		uint32_t bcal_start                       :  1; /**<bit[22 : 22] */
		uint32_t bcal_en                          :  1; /**<bit[23 : 23] */
		uint32_t bcal_sel                         :  3; /**<bit[24 : 26] */
		uint32_t vbias                            :  5; /**<bit[27 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg5_t;


typedef volatile union {
	struct {
		uint32_t calib_interval                   : 10; /**<bit[0 : 9] */
		uint32_t modify_interval                  :  6; /**<bit[10 : 15] */
		uint32_t xtal_wakeup_time                 :  4; /**<bit[16 : 19] */
		uint32_t spi_trig                         :  1; /**<bit[20 : 20] */
		uint32_t modifi_auto                      :  1; /**<bit[21 : 21] */
		uint32_t calib_auto                       :  1; /**<bit[22 : 22] */
		uint32_t cal_mode                         :  1; /**<bit[23 : 23] */
		uint32_t manu_ena                         :  1; /**<bit[24 : 24] */
		uint32_t manu_cin                         :  7; /**<bit[25 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg6_t;


typedef volatile union {
	struct {
		uint32_t nsyn                             :  1; /**<bit[0 : 0] */
		uint32_t bandmanual                       :  6; /**<bit[1 : 6] */
		uint32_t ckref_loop_sel                   :  1; /**<bit[7 : 7] */
		uint32_t ioffs                            :  3; /**<bit[8 : 10] */
		uint32_t reset_nload                      :  1; /**<bit[11 : 11] */
		uint32_t closeloop_en                     :  1; /**<bit[12 : 12] */
		uint32_t modecal                          :  1; /**<bit[13 : 13] */
		uint32_t spi_rstn                         :  1; /**<bit[14 : 14] */
		uint32_t osccal_trig                      :  1; /**<bit[15 : 15] */
		uint32_t manual                           :  1; /**<bit[16 : 16] */
		uint32_t diff                             :  3; /**<bit[17 : 19] */
		uint32_t ictrlmanual                      :  3; /**<bit[20 : 22] */
		uint32_t cnti                             :  9; /**<bit[23 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg7_t;


typedef volatile union {
	struct {
		uint32_t reserved_bit_0_30                : 31; /**<bit[0 : 30] */
		uint32_t n                                :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg8_t;


typedef volatile union {
	struct {
		uint32_t clk_sel                          :  1; /**<bit[0 : 0] */
		uint32_t coreldo_hp                       :  1; /**<bit[1 : 1] */
		uint32_t dldohp                           :  1; /**<bit[2 : 2] */
		uint32_t t_vanaldosel                     :  3; /**<bit[3 : 5] */
		uint32_t r_vanaldosel                     :  3; /**<bit[6 : 8] */
		uint32_t en_trsw                          :  1; /**<bit[9 : 9] */
		uint32_t aldohp                           :  1; /**<bit[10 : 10] */
		uint32_t anacurlim                        :  1; /**<bit[11 : 11] */
		uint32_t hsldo_hp                         :  1; /**<bit[12 : 12] */
		uint32_t pwd_hsldo                        :  1; /**<bit[13 : 13] */
		uint32_t enfast_hsldo                     :  1; /**<bit[14 : 14] */
		uint32_t nc_15_15                         :  1; /**<bit[15 : 15] */
		uint32_t valoldosel                       :  3; /**<bit[16 : 18] */
		uint32_t alopowsel                        :  1; /**<bit[19 : 19] */
		uint32_t en_fast_aloldo                   :  1; /**<bit[20 : 20] */
		uint32_t aloldohp                         :  1; /**<bit[21 : 21] */
		uint32_t bgcal                            :  6; /**<bit[22 : 27] */
		uint32_t vbgcalmode                       :  1; /**<bit[28 : 28] */
		uint32_t vbgcalstart                      :  1; /**<bit[29 : 29] */
		uint32_t pwd_bgcal                        :  1; /**<bit[30 : 30] */
		uint32_t spi_envbg                        :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg9_t;


typedef volatile union {
	struct {
		uint32_t azcd_manual                      :  6; /**<bit[0 : 5] */
		uint32_t azcdrefs                         :  2; /**<bit[6 : 7] */
		uint32_t reserved_bit_8_8                 :  1; /**<bit[8 : 8] */
		uint32_t spi_latchb                       :  1; /**<bit[9 : 9] */
		uint32_t digcurlim                        :  1; /**<bit[10 : 10] */
		uint32_t rtc_wkrstn                       :  1; /**<bit[11 : 11] */
		uint32_t rst_wks                          :  1; /**<bit[12 : 12] */
		uint32_t d_veasel1v                       :  2; /**<bit[13 : 14] */
		uint32_t ensfsdd                          :  1; /**<bit[15 : 15] */
		uint32_t vcorehsel                        :  4; /**<bit[16 : 19] */
		uint32_t vcorelsel                        :  3; /**<bit[20 : 22] */
		uint32_t vlden                            :  1; /**<bit[23 : 23] */
		uint32_t en_fast_coreldo                  :  1; /**<bit[24 : 24] */
		uint32_t pwdcoreldo                       :  1; /**<bit[25 : 25] */
		uint32_t vdighsel                         :  3; /**<bit[26 : 28] */
		uint32_t vdigsel                          :  2; /**<bit[29 : 30] */
		uint32_t vdd12lden                        :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg10_t;


typedef volatile union {
	struct {
		uint32_t aldo_czsel                       :  3; /**<bit[0 : 2] */
		uint32_t zldo_rzsel                       :  2; /**<bit[3 : 4] */
		uint32_t azcdswvs                         :  3; /**<bit[5 : 7] */
		uint32_t aenzcddy                         :  1; /**<bit[8 : 8] */
		uint32_t aenzcdmsel                       :  1; /**<bit[9 : 9] */
		uint32_t aenzcdcalib                      :  1; /**<bit[10 : 10] */
		uint32_t en_corepsw                       :  1; /**<bit[11 : 11] */
		uint32_t en_alopsw                        :  1; /**<bit[12 : 12] */
		uint32_t nc_13_14                         :  2; /**<bit[13 : 14] */
		uint32_t spi_timerwken                    :  1; /**<bit[15 : 15] */
		uint32_t spi_byp32pwd                     :  1; /**<bit[16 : 16] */
		uint32_t sd                               :  1; /**<bit[17 : 17] */
		uint32_t nc_18_18                         :  1; /**<bit[18 : 18] */
		uint32_t gpio_wkrst1v                     :  1; /**<bit[19 : 19] */
		uint32_t ckfs                             :  2; /**<bit[20 : 21] */
		uint32_t ckintsel                         :  1; /**<bit[22 : 22] */
		uint32_t osccaltrig                       :  1; /**<bit[23 : 23] */
		uint32_t mroscsel                         :  1; /**<bit[24 : 24] */
		uint32_t mrosci_cal                       :  3; /**<bit[25 : 27] */
		uint32_t mrosccap_cal                     :  4; /**<bit[28 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg11_t;


typedef volatile union {
	struct {
		uint32_t sfsr                             :  4; /**<bit[0 : 3] */
		uint32_t ensfsaa                          :  1; /**<bit[4 : 4] */
		uint32_t apfms                            :  5; /**<bit[5 : 9] */
		uint32_t atmpo_sel                        :  2; /**<bit[10 : 11] */
		uint32_t ampoen                           :  1; /**<bit[12 : 12] */
		uint32_t enpowa                           :  1; /**<bit[13 : 13] */
		uint32_t avea_sel                         :  2; /**<bit[14 : 15] */
		uint32_t aforcepfm                        :  1; /**<bit[16 : 16] */
		uint32_t acls                             :  3; /**<bit[17 : 19] */
		uint32_t aswrsten                         :  1; /**<bit[20 : 20] */
		uint32_t aripc                            :  3; /**<bit[21 : 23] */
		uint32_t arampc                           :  4; /**<bit[24 : 27] */
		uint32_t arampcen                         :  1; /**<bit[28 : 28] */
		uint32_t aenburst                         :  1; /**<bit[29 : 29] */
		uint32_t apfmen                           :  1; /**<bit[30 : 30] */
		uint32_t aldosel                          :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg12_t;


typedef volatile union {
	struct {
		uint32_t buckd_softst                     :  4; /**<bit[0 : 3] */
		uint32_t denzcdcalib                      :  1; /**<bit[4 : 4] */
		uint32_t nc_5_6                           :  2; /**<bit[5 : 6] */
		uint32_t vddgpio_sel                      :  1; /**<bit[7 : 7] */
		uint32_t dpfms                            :  5; /**<bit[8 : 12] */
		uint32_t dtmpo_sel                        :  2; /**<bit[13 : 14] */
		uint32_t dmpoen                           :  1; /**<bit[15 : 15] */
		uint32_t dforcepfm                        :  1; /**<bit[16 : 16] */
		uint32_t dcls                             :  3; /**<bit[17 : 19] */
		uint32_t dswrsten                         :  1; /**<bit[20 : 20] */
		uint32_t dripc                            :  3; /**<bit[21 : 23] */
		uint32_t drampc                           :  4; /**<bit[24 : 27] */
		uint32_t drampcen                         :  1; /**<bit[28 : 28] */
		uint32_t denburst                         :  1; /**<bit[29 : 29] */
		uint32_t dpfmen                           :  1; /**<bit[30 : 30] */
		uint32_t dldosel                          :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg13_t;


typedef volatile union {
	struct {
		uint32_t pwdovp1v                         :  1; /**<bit[0 : 0] */
		uint32_t asoft_stc                        :  4; /**<bit[1 : 4] */
		uint32_t dldo_czsel                       :  3; /**<bit[5 : 7] */
		uint32_t dldo_rzsel                       :  2; /**<bit[8 : 9] */
		uint32_t en_usbvcc18                      :  1; /**<bit[10 : 10] */
		uint32_t en_usbvcc3v                      :  1; /**<bit[11 : 11] */
		uint32_t vtrxspisel                       :  2; /**<bit[12 : 13] */
		uint32_t denzcddy                         :  1; /**<bit[14 : 14] */
		uint32_t dzcd_swvs                        :  3; /**<bit[15 : 17] */
		uint32_t dzcd_refs                        :  3; /**<bit[18 : 20] */
		uint32_t dzcd_manu                        :  6; /**<bit[21 : 26] */
		uint32_t azcdmsel                         :  1; /**<bit[27 : 27] */
		uint32_t psldo_swb                        :  1; /**<bit[28 : 28] */
		uint32_t vpsramsel                        :  2; /**<bit[29 : 30] */
		uint32_t enpsram                          :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg14_t;


typedef volatile union {
	struct {
		uint32_t gpiowken                         : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg15_t;


typedef volatile union {
	struct {
		uint32_t timer_set                        :  4; /**<bit[0 : 3] */
		uint32_t rtc_set                          :  4; /**<bit[4 : 7] */
		uint32_t nc_8_10                          :  3; /**<bit[8 : 10] */
		uint32_t vcorehssel                       :  4; /**<bit[11 : 14] */
		uint32_t vbuckhssel                       :  3; /**<bit[15 : 17] */
		uint32_t hsenfast                         :  1; /**<bit[18 : 18] */
		uint32_t enhspw                           :  1; /**<bit[19 : 19] */
		uint32_t buckhs_soft_stc                  :  4; /**<bit[20 : 23] */
		uint32_t hs_veasel                        :  2; /**<bit[24 : 25] */
		uint32_t hszcd_manual                     :  6; /**<bit[26 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg16_t;


typedef volatile union {
	struct {
		uint32_t rtc_set                          : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg17_t;


typedef volatile union {
	struct {
		uint32_t timer_set                        : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg18_t;


typedef volatile union {
	struct {
		uint32_t hsenzcddy                        :  1; /**<bit[0 : 0] */
		uint32_t hsenzcdcalib                     :  1; /**<bit[1 : 1] */
		uint32_t hszcdswvs                        :  3; /**<bit[2 : 4] */
		uint32_t hszcdrefs                        :  3; /**<bit[5 : 7] */
		uint32_t hszcdmsel                        :  1; /**<bit[8 : 8] */
		uint32_t hspfms                           :  5; /**<bit[9 : 13] */
		uint32_t hstmpo_sel                       :  2; /**<bit[14 : 15] */
		uint32_t hsmpoen                          :  1; /**<bit[16 : 16] */
		uint32_t hsforcepfm                       :  1; /**<bit[17 : 17] */
		uint32_t hscls                            :  3; /**<bit[18 : 20] */
		uint32_t hsswrsten                        :  1; /**<bit[21 : 21] */
		uint32_t hsripc                           :  3; /**<bit[22 : 24] */
		uint32_t hsrampc                          :  4; /**<bit[25 : 28] */
		uint32_t hsrampcen                        :  1; /**<bit[29 : 29] */
		uint32_t hsenburst                        :  1; /**<bit[30 : 30] */
		uint32_t hspfmen                          :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg19_t;


