bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_aonp_struct.h
typedef volatile union {
	struct {
		uint32_t iselaud                          :  1; /**<bit[0 : 0] */
		uint32_t audck_rlcen                      :  1; /**<bit[1 : 1] */
		uint32_t lchckinven                       :  1; /**<bit[2 : 2] */
		uint32_t enaudbias                        :  1; /**<bit[3 : 3] */
		uint32_t enadcbias                        :  1; /**<bit[4 : 4] */
		uint32_t enmicbias                        :  1; /**<bit[5 : 5] */
		uint32_t adcckinven                       :  1; /**<bit[6 : 6] */
		uint32_t spi                              :  1; /**<bit[7 : 7] */
		uint32_t adctsten                         :  1; /**<bit[8 : 8] */
		uint32_t micbias_trm                      :  2; /**<bit[9 : 10] */
		uint32_t micbias_voc                      :  5; /**<bit[11 : 15] */
		uint32_t vrefsel                          :  1; /**<bit[16 : 16] */
		uint32_t capsw                            :  5; /**<bit[17 : 21] */
		uint32_t adcref_sel                       :  2; /**<bit[22 : 23] */
		uint32_t adcvcmsel                        :  2; /**<bit[24 : 25] */
		uint32_t spi_1                            :  1; /**<bit[26 : 26] */
		uint32_t audadjref                        :  5; /**<bit[27 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg20_t;


typedef volatile union {
	struct {
		uint32_t isel_mic1                        :  2; /**<bit[0 : 1] */
		uint32_t micirsel1_mic1                   :  1; /**<bit[2 : 2] */
		uint32_t vcmsel_mic1                      :  1; /**<bit[3 : 3] */
		uint32_t enfsr_mic1                       :  1; /**<bit[4 : 4] */
		uint32_t enopoclip_mic1                   :  1; /**<bit[5 : 5] */
		uint32_t da2aden_mic1                     :  1; /**<bit[6 : 6] */
		uint32_t imatch_mic1                      :  4; /**<bit[7 : 10] */
		uint32_t imatch_en_mic1                   :  1; /**<bit[11 : 11] */
		uint32_t dccompen_mic1                    :  1; /**<bit[12 : 12] */
		uint32_t micsingleen_mic1                 :  1; /**<bit[13 : 13] */
		uint32_t nc_14_14                         :  1; /**<bit[14 : 14] */
		uint32_t micgain_mic1                     :  4; /**<bit[15 : 18] */
		uint32_t nc_19_23                         :  5; /**<bit[19 : 23] */
		uint32_t dwamode_mic1                     :  1; /**<bit[24 : 24] */
		uint32_t nc_25_27                         :  3; /**<bit[25 : 27] */
		uint32_t micen_mic1                       :  1; /**<bit[28 : 28] */
		uint32_t rst_mic1                         :  1; /**<bit[29 : 29] */
		uint32_t bpdwa1v_mic1                     :  1; /**<bit[30 : 30] */
		uint32_t hcen1stg_mic1                    :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg21_t;


typedef volatile union {
	struct {
		uint32_t ictrl_dsppll                     :  1; /**<bit[0 : 0] */
		uint32_t lvref                            :  2; /**<bit[1 : 2] */
		uint32_t reserved_bit_3_3                 :  1; /**<bit[3 : 3] */
		uint32_t nc_4_18                          : 15; /**<bit[4 : 18] */
		uint32_t mode                             :  1; /**<bit[19 : 19] */
		uint32_t iamsel                           :  1; /**<bit[20 : 20] */
		uint32_t hvref                            :  2; /**<bit[21 : 22] */
		uint32_t lvref_1                          :  2; /**<bit[23 : 24] */
		uint32_t nc_25_31                         :  7; /**<bit[25 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg22_t;


typedef volatile union {
	struct {
		uint32_t camsel                           :  1; /**<bit[0 : 0] */
		uint32_t msw                              :  9; /**<bit[1 : 9] */
		uint32_t tstcken_dpll                     :  1; /**<bit[10 : 10] */
		uint32_t osccal_trig                      :  1; /**<bit[11 : 11] */
		uint32_t cnti                             :  9; /**<bit[12 : 20] */
		uint32_t nc_21_21                         :  1; /**<bit[21 : 21] */
		uint32_t spi_rst                          :  1; /**<bit[22 : 22] */
		uint32_t closeloop_en                     :  1; /**<bit[23 : 23] */
		uint32_t caltime                          :  1; /**<bit[24 : 24] */
		uint32_t lpfrz                            :  2; /**<bit[25 : 26] */
		uint32_t icp                              :  4; /**<bit[27 : 30] */
		uint32_t cp2ctrl                          :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg23_t;


typedef volatile union {
	struct {
		uint32_t nc_0_31                          : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg24_t;


typedef volatile union {
	struct {
		uint32_t int_mod                          :  1; /**<bit[0 : 0] */
		uint32_t nsyn                             :  1; /**<bit[1 : 1] */
		uint32_t open_enb                         :  1; /**<bit[2 : 2] */
		uint32_t reset                            :  1; /**<bit[3 : 3] */
		uint32_t ioffsetl                         :  3; /**<bit[4 : 6] */
		uint32_t lpfrz                            :  4; /**<bit[7 : 10] */
		uint32_t vsel                             :  3; /**<bit[11 : 13] */
		uint32_t vsel_cal                         :  1; /**<bit[14 : 14] */
		uint32_t pwd_lockdet                      :  1; /**<bit[15 : 15] */
		uint32_t lockdet_bypass                   :  1; /**<bit[16 : 16] */
		uint32_t ckref_loop_sel                   :  1; /**<bit[17 : 17] */
		uint32_t spi_trigger                      :  1; /**<bit[18 : 18] */
		uint32_t manual                           :  1; /**<bit[19 : 19] */
		uint32_t test_ckaudio_en                  :  1; /**<bit[20 : 20] */
		uint32_t ck2xen                           :  1; /**<bit[21 : 21] */
		uint32_t icp                              :  2; /**<bit[22 : 23] */
		uint32_t cktst_sel                        :  1; /**<bit[24 : 24] */
		uint32_t edgesel_nck                      :  1; /**<bit[25 : 25] */
		uint32_t nloaddlyen                       :  1; /**<bit[26 : 26] */
		uint32_t bypass_caldone_auto              :  1; /**<bit[27 : 27] */
		uint32_t cal_res_spi                      :  3; /**<bit[28 : 30] */
		uint32_t audioen                          :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg25_t;


typedef volatile union {
	struct {
		uint32_t n                                : 30; /**<bit[0 : 29] */
		uint32_t calres_spien                     :  1; /**<bit[30 : 30] */
		uint32_t calrefen                         :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg26_t;


typedef volatile union {
	struct {
		uint32_t isel_mic2                        :  2; /**<bit[0 : 1] */
		uint32_t micirsel1_mic2                   :  1; /**<bit[2 : 2] */
		uint32_t vcmsel_mic2                      :  1; /**<bit[3 : 3] */
		uint32_t enfsr_mic2                       :  1; /**<bit[4 : 4] */
		uint32_t enopoclip_mic2                   :  1; /**<bit[5 : 5] */
		uint32_t da2aden_mic2                     :  1; /**<bit[6 : 6] */
		uint32_t imatch_mic2                      :  4; /**<bit[7 : 10] */
		uint32_t imatch_en_mic2                   :  1; /**<bit[11 : 11] */
		uint32_t dccompen_mic2                    :  1; /**<bit[12 : 12] */
		uint32_t micsingleen_mic2                 :  1; /**<bit[13 : 13] */
		uint32_t nc_14_14                         :  1; /**<bit[14 : 14] */
		uint32_t micgain_mic2                     :  4; /**<bit[15 : 18] */
		uint32_t nc_19_23                         :  5; /**<bit[19 : 23] */
		uint32_t dwamode_mic2                     :  1; /**<bit[24 : 24] */
		uint32_t nc_25_27                         :  3; /**<bit[25 : 27] */
		uint32_t micen_mic2                       :  1; /**<bit[28 : 28] */
		uint32_t rst_mic2                         :  1; /**<bit[29 : 29] */
		uint32_t bpdwa1v_mic2                     :  1; /**<bit[30 : 30] */
		uint32_t hcen1stg_mic2                    :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg27_t;


typedef volatile union {
	struct {
		uint32_t isel_mic3                        :  2; /**<bit[0 : 1] */
		uint32_t micirsel1_mic3                   :  1; /**<bit[2 : 2] */
		uint32_t vcmsel_mic3                      :  1; /**<bit[3 : 3] */
		uint32_t enfsr_mic3                       :  1; /**<bit[4 : 4] */
		uint32_t enopoclip_mic3                   :  1; /**<bit[5 : 5] */
		uint32_t da2aden_mic3                     :  1; /**<bit[6 : 6] */
		uint32_t imatch_mic3                      :  4; /**<bit[7 : 10] */
		uint32_t imatch_en_mic3                   :  1; /**<bit[11 : 11] */
		uint32_t dccompen_mic3                    :  1; /**<bit[12 : 12] */
		uint32_t micsingleen_mic3                 :  1; /**<bit[13 : 13] */
		uint32_t nc_14_14                         :  1; /**<bit[14 : 14] */
		uint32_t micgain_mic3                     :  4; /**<bit[15 : 18] */
		uint32_t nc_19_23                         :  5; /**<bit[19 : 23] */
		uint32_t dwamode_mic3                     :  1; /**<bit[24 : 24] */
		uint32_t nc_25_27                         :  3; /**<bit[25 : 27] */
		uint32_t micen_mic3                       :  1; /**<bit[28 : 28] */
		uint32_t rst_mic3                         :  1; /**<bit[29 : 29] */
		uint32_t bpdwa1v_mic3                     :  1; /**<bit[30 : 30] */
		uint32_t hcen1stg_mic3                    :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg28_t;


typedef volatile union {
	struct {
		uint32_t hpdac                            :  1; /**<bit[0 : 0] */
		uint32_t iselstg                          :  1; /**<bit[1 : 1] */
		uint32_t oscdac                           :  2; /**<bit[2 : 3] */
		uint32_t ocendac                          :  1; /**<bit[4 : 4] */
		uint32_t vseldco                          :  1; /**<bit[5 : 5] */
		uint32_t srsel                            :  1; /**<bit[6 : 6] */
		uint32_t hpoen                            :  1; /**<bit[7 : 7] */
		uint32_t lbwen                            :  1; /**<bit[8 : 8] */
		uint32_t calsel                           :  1; /**<bit[9 : 9] */
		uint32_t bp2vldo                          :  1; /**<bit[10 : 10] */
		uint32_t dcochg                           :  2; /**<bit[11 : 12] */
		uint32_t diffen                           :  1; /**<bit[13 : 13] */
		uint32_t endaccal                         :  1; /**<bit[14 : 14] */
		uint32_t rendcoc                          :  1; /**<bit[15 : 15] */
		uint32_t lendcoc                          :  1; /**<bit[16 : 16] */
		uint32_t renvcmd                          :  1; /**<bit[17 : 17] */
		uint32_t lenvcmd                          :  1; /**<bit[18 : 18] */
		uint32_t dacdrven                         :  1; /**<bit[19 : 19] */
		uint32_t dacren                           :  1; /**<bit[20 : 20] */
		uint32_t daclen                           :  1; /**<bit[21 : 21] */
		uint32_t dacg                             :  4; /**<bit[22 : 25] */
		uint32_t dacmute                          :  1; /**<bit[26 : 26] */
		uint32_t dacdwamode_sel                   :  1; /**<bit[27 : 27] */
		uint32_t ckpsel                           :  1; /**<bit[28 : 28] */
		uint32_t nc_29_31                         :  3; /**<bit[29 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg29_t;


typedef volatile union {
	struct {
		uint32_t lmdcin                           :  8; /**<bit[0 : 7] */
		uint32_t rmdcin                           :  8; /**<bit[8 : 15] */
		uint32_t spirst_ovc                       :  1; /**<bit[16 : 16] */
		uint32_t enidacr                          :  1; /**<bit[17 : 17] */
		uint32_t enidacl                          :  1; /**<bit[18 : 18] */
		uint32_t dac3rdhc0v9                      :  1; /**<bit[19 : 19] */
		uint32_t hc2s                             :  1; /**<bit[20 : 20] */
		uint32_t sng_fb_en                        :  1; /**<bit[21 : 21] */
		uint32_t rfb_ctrl                         :  1; /**<bit[22 : 22] */
		uint32_t enbs                             :  1; /**<bit[23 : 23] */
		uint32_t calck_sel0v9                     :  1; /**<bit[24 : 24] */
		uint32_t bpdwa0v9                         :  1; /**<bit[25 : 25] */
		uint32_t looprst0v9                       :  1; /**<bit[26 : 26] */
		uint32_t oct0v9                           :  2; /**<bit[27 : 28] */
		uint32_t sout0v9                          :  1; /**<bit[29 : 29] */
		uint32_t hc0v9                            :  2; /**<bit[30 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg30_t;


typedef volatile union {
	struct {
		uint32_t nc_0_31                          : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg31_t;


typedef volatile union {
	struct {
		uint32_t new_ana_reg                      : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg32_t;


typedef volatile union {
	struct {
		uint32_t new_ana_reg                      : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg33_t;


typedef volatile union {
	struct {
		uint32_t new_ana_reg                      : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg34_t;


typedef volatile union {
	struct {
		uint32_t new_ana_reg                      : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg35_t;


typedef volatile union {
	struct {
		uint32_t new_ana_reg                      : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg36_t;


typedef volatile union {
	struct {
		uint32_t new_ana_reg                      : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg37_t;


typedef volatile union {
	struct {
		uint32_t new_ana_reg                      : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg38_t;


typedef volatile union {
	struct {
		uint32_t new_ana_reg                      : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg39_t;


typedef volatile union {
	struct {
		uint32_t new_ana_reg                      : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg40_t;


typedef volatile union {
	struct {
		uint32_t new_ana_reg                      : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg41_t;


typedef volatile union {
	struct {
		uint32_t new_ana_reg                      : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg42_t;


typedef volatile union {
	struct {
		uint32_t new_ana_reg                      : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg43_t;


typedef volatile union {
	struct {
		uint32_t new_ana_reg                      : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg44_t;


typedef volatile union {
	struct {
		uint32_t new_ana_reg                      : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg45_t;


typedef volatile union {
	struct {
		uint32_t new_ana_reg                      : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg46_t;


typedef volatile union {
	struct {
		uint32_t new_ana_reg                      : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_aonp_ana_reg47_t;

typedef volatile struct {
	volatile sys_aonp_reg0_t reg0;
	volatile sys_aonp_reg1_t reg1;
	volatile sys_aonp_reg2_t reg2;
	volatile sys_aonp_reg3_t reg3;
	volatile sys_aonp_reg4_t reg4;
	volatile sys_aonp_reg5_t reg5;
	volatile uint32_t rsv_6_7[2];
	volatile sys_aonp_reg8_t reg8;
	volatile sys_aonp_reg9_t reg9;
	volatile sys_aonp_rega_t rega;
	volatile sys_aonp_regb_t regb;
	volatile sys_aonp_regc_t regc;
	volatile sys_aonp_regd_t regd;
	volatile uint32_t rsv_e_e[1];
	volatile sys_aonp_regf_t regf;
	volatile sys_aonp_reg10_t reg10;
	volatile sys_aonp_reg11_t reg11;
	volatile uint32_t rsv_12_13[2];
	volatile sys_aonp_reg14_t reg14;
	volatile sys_aonp_reg15_t reg15;
	volatile sys_aonp_reg16_t reg16;
	volatile sys_aonp_reg17_t reg17;
	volatile sys_aonp_reg18_t reg18;
	volatile sys_aonp_reg19_t reg19;
	volatile sys_aonp_reg1a_t reg1a;
	volatile sys_aonp_reg1b_t reg1b;
	volatile sys_aonp_reg1c_t reg1c;
	volatile uint32_t rsv_1d_1d[1];
	volatile sys_aonp_reg1e_t reg1e;
	volatile sys_aonp_reg1f_t reg1f;
	volatile sys_aonp_reg20_t reg20;
	volatile sys_aonp_reg21_t reg21;
	volatile sys_aonp_reg22_t reg22;
	volatile sys_aonp_reg23_t reg23;
	volatile sys_aonp_reg24_t reg24;
	volatile sys_aonp_reg25_t reg25;
	volatile sys_aonp_reg26_t reg26;
	volatile sys_aonp_reg27_t reg27;
	volatile sys_aonp_reg28_t reg28;
	volatile uint32_t rsv_29_29[1];
	volatile sys_aonp_reg2a_t reg2a;
	volatile sys_aonp_reg2b_t reg2b;
	volatile sys_aonp_reg2c_t reg2c;
	volatile uint32_t rsv_2d_2d[1];
	volatile sys_aonp_reg2e_t reg2e;
	volatile sys_aonp_reg2f_t reg2f;
	volatile sys_aonp_reg30_t reg30;
	volatile sys_aonp_reg31_t reg31;
	volatile sys_aonp_reg32_t reg32;
	volatile sys_aonp_reg33_t reg33;
	volatile sys_aonp_reg34_t reg34;
	volatile sys_aonp_reg35_t reg35;
	volatile sys_aonp_reg36_t reg36;
	volatile sys_aonp_reg37_t reg37;
	volatile sys_aonp_reg38_t reg38;
	volatile sys_aonp_reg39_t reg39;
	volatile sys_aonp_reg3a_t reg3a;
	volatile sys_aonp_reg3b_t reg3b;
	volatile sys_aonp_reg3c_t reg3c;
	volatile sys_aonp_reg3d_t reg3d;
	volatile sys_aonp_reg3e_t reg3e;
	volatile sys_aonp_reg3f_t reg3f;
	volatile sys_aonp_ana_reg0_t ana_reg0;
	volatile sys_aonp_ana_reg1_t ana_reg1;
	volatile sys_aonp_ana_reg2_t ana_reg2;
	volatile sys_aonp_ana_reg3_t ana_reg3;
	volatile sys_aonp_ana_reg4_t ana_reg4;
	volatile sys_aonp_ana_reg5_t ana_reg5;
	volatile sys_aonp_ana_reg6_t ana_reg6;
	volatile sys_aonp_ana_reg7_t ana_reg7;
	volatile sys_aonp_ana_reg8_t ana_reg8;
	volatile sys_aonp_ana_reg9_t ana_reg9;
	volatile sys_aonp_ana_reg10_t ana_reg10;
	volatile sys_aonp_ana_reg11_t ana_reg11;
	volatile sys_aonp_ana_reg12_t ana_reg12;
	volatile sys_aonp_ana_reg13_t ana_reg13;
	volatile sys_aonp_ana_reg14_t ana_reg14;
	volatile sys_aonp_ana_reg15_t ana_reg15;
	volatile sys_aonp_ana_reg16_t ana_reg16;
	volatile sys_aonp_ana_reg17_t ana_reg17;
	volatile sys_aonp_ana_reg18_t ana_reg18;
	volatile sys_aonp_ana_reg19_t ana_reg19;
	volatile sys_aonp_ana_reg20_t ana_reg20;
	volatile sys_aonp_ana_reg21_t ana_reg21;
	volatile sys_aonp_ana_reg22_t ana_reg22;
	volatile sys_aonp_ana_reg23_t ana_reg23;
	volatile sys_aonp_ana_reg24_t ana_reg24;
	volatile sys_aonp_ana_reg25_t ana_reg25;
	volatile sys_aonp_ana_reg26_t ana_reg26;
	volatile sys_aonp_ana_reg27_t ana_reg27;
	volatile sys_aonp_ana_reg28_t ana_reg28;
	volatile sys_aonp_ana_reg29_t ana_reg29;
	volatile sys_aonp_ana_reg30_t ana_reg30;
	volatile sys_aonp_ana_reg31_t ana_reg31;
	volatile sys_aonp_ana_reg32_t ana_reg32;
	volatile sys_aonp_ana_reg33_t ana_reg33;
	volatile sys_aonp_ana_reg34_t ana_reg34;
	volatile sys_aonp_ana_reg35_t ana_reg35;
	volatile sys_aonp_ana_reg36_t ana_reg36;
	volatile sys_aonp_ana_reg37_t ana_reg37;
	volatile sys_aonp_ana_reg38_t ana_reg38;
	volatile sys_aonp_ana_reg39_t ana_reg39;
	volatile sys_aonp_ana_reg40_t ana_reg40;
	volatile sys_aonp_ana_reg41_t ana_reg41;
	volatile sys_aonp_ana_reg42_t ana_reg42;
	volatile sys_aonp_ana_reg43_t ana_reg43;
	volatile sys_aonp_ana_reg44_t ana_reg44;
	volatile sys_aonp_ana_reg45_t ana_reg45;
	volatile sys_aonp_ana_reg46_t ana_reg46;
	volatile sys_aonp_ana_reg47_t ana_reg47;
} sys_aonp_hw_t;

#ifdef __cplusplus
}
#endif
